{
  "language": "Galego",
  "menu-index": "Inicio",
  "menu-tutorials": "Titoriais",
  "menu-events": "Eventos",
  "menu-chapters": "Capítulos",
  "menu-about": "Acerca",
  "menu-building-workshops": "Construe",
  "menu-host": "Organiza",
  "footer-contact-header": "Contacto",
  "footer-contribute-header": "Contribue",
  "footer-contribute-question": "Abre un issue",
  "footer-contribute-answer": "Responde unha pregunta",
  "footer-about-header": "Acerca",
  "footer-about-build": "Construe un Obradoiro",
  "footer-about-host": "Organiza un Obradoiro",
  "index-header-top": "Obradoiros open source feitos con Node que corren na túa terminal. Fainos pola túa conta ou no teu obradoiro máis cercano.",
  "index-header-bottom": "Comeza por instalar uno dos nosos",
  "index-header-bottomA": "Obradoiros",
  "index-header-bottomB": "ou suscríbete ao noso gratuito",
  "index-header-bottomC": "Boletín por correo electrónico",
  "index-get-started": "Comeza co obradoiro Learn You Node:",
  "index-workshop-header": "Obradoiros",
  "index-workshop-info": "Estos son obradoiros de maneira presencial, xeralmente sen custe, nos cales os talleres son utilizados como plans de estudo e os mentores axudan aos participantes a completar os exercicios.",
  "index-workshop-links-host": "Organiza o teu",
  "index-workshop-links-events": "Mira todos los eventos",
  "index-workshop-links-writeups": "Resumos dos eventos pasados",
  "index-upcoming-header": "Workshops próximos",
  "index-upcoming-loading": "Cargando...",
  "index-upcoming-error": "Non se poideron cargar os eventos. Lamentámolo!",
  "index-upcoming-all-events": "Mira todos os eventos",
  "index-upcoming-no-events": "Non hai eventos próximos.",
  "index-upcoming-past-events": "Eventos pasados",
  "index-upcoming-past-events2": "!",
  "index-host-header": "Calquera pode organizar",
  "index-host-past": "Houbo un total de",
  "index-host-past2": "eventos!",
  "index-host-want-to-host": "NodeSchool é descentralizado, open source e feito por voluntarios. Queres organizar un evento? Dalle un vistazo aos ",
  "index-host-want-to-host2": "recursos e consellos",
  "index-host-want-to-host3": ".",
  "index-workshopper-header": "Talleres",
  "index-workshopper-info": "O formato das leccións open source asociadas a NodeSchool se denomina \"Workshopper\". Todos los talleres son autoguiados (no necesitas presenciar un obradoiro para realizarlo), funcionan na súa maioría offline.",
  "index-workshopper-list-view": "Ver Lista de Obradoiros",
  "index-workshopper-list-problem": "Fai preguntas",
  "index-workshopper-list-faq": "Responde preguntas",
  "index-workshopper-list-host": "Construe un obradoiro",
  "index-get-going-header": "Comeza —",
  "index-get-going-info": "Necesitarás ",
  "index-get-going-info2": "na túa computadora para comezar con cada un destos. Utiliza",
  "index-get-going-info3": "(incluído en Node) para instalar cada módulo utilizando o comando debaixo do mesmo. unha vez instalado, simplemente escribe o nome do obradoiro para comezar.",
  "index-get-going-editor": "Tamén necesitarás un",
  "index-get-going-editor2": "Editor de texto",
  "index-get-going-editor3": ", se non tes un todavía, tal vez che interese algún de estes:",
  "index-get-going-editor4": ",",
  "index-get-going-editor5": ",",
  "index-get-going-editor6": ",",
  "index-get-going-editor7": ".",
  "index-get-going-help-pre": "Problemas con algún dos Talleres? Intenta instalando a última versión de Node.js (v6.2.0 ou posterior), ou formula unha pregunta no taboleiro de",
  "index-get-going-help-post": "",
  "index-Talleres-core-header": "Esenciais",
  "index-Talleres-core-info": "Estos talleres enfocanse en habilidades esenciais para poder traballar con Node.js.",
  "index-Talleres-core-link-pre": "Non logras avanzar? Crea unha pregunta na ",
  "index-Talleres-core-link-text": "discusión",
  "index-Talleres-core-link-post": ".",
  "index-Talleres-elective-header": "Opcionais",
  "index-Talleres-elective-info": "Talleres de librerías populares ou diferentes formas de escribir Node.js.",
  "index-Talleres-elective-link-pre": "Non logras avanzar? Crea unha pregunta na ",
  "index-Talleres-elective-link-post": ".",
  "index-Talleres-elective-link-text": "discusión",
  "workshopper-javascripting": "Aprende os elementos básicos de JavaScript. Non se require experiencia previa en programación.",
  "workshopper-learnyounode": "Aprende os elementos básicos de Node: entrada/saida asincrónica, http.",
  "workshopper-gitit": "Aprende os elementos básicos de Git e GitHub.",
  "workshopper-scope-chains-closures": "Aprende os detalles de Scope, Scope Chains, Closures, e Garbage Collection.",
  "workshopper-how-to-npm": "Aprende cómo usar e crear módulos npm",
  "workshopper-streamadventure": "Aprende a compoñer interfaces de streams con",
  "workshopper-streamadventure2": ".",
  "workshopper-elementary-electron": "Construe unha aplicación de escritorio usando Node e Chromium xunto con Electron.",
  "workshopper-how-to-markdown": "Aprende cómo usar Markdown (Una linguaxe de marcado lixeiro con sintaxe de formato de texto plano).",
  "workshopper-functionaljavascript": "Aprende acerca das características fundamentais da programación funcional de JavaScript en puro ES5.",
  "workshopper-levelmeup": "Aprende a utilizar leveldb, unha base de datos de clave/valor simple.",
  "workshopper-expressworks": "Aprende os elementos básicos do framework Express.js.",
  "workshopper-makemehapi": "Aprende todo sobre hapi mediante unha serie de exercicios.",
  "workshopper-promise-it-wont-hurt": "Aprende a utilizar promesas en JavaScript para o manexo de operacións asincrónicas.",
  "workshopper-async-you": "Aprende a utilizar o paquete async.",
  "workshopper-nodebot-workshop": "Crea robots coa API de jhonny-five.",
  "workshopper-goingnative": "unha exploración de Node.js dende adentro: add-ons C++ nativos.",
  "workshopper-planetproto": "Comprendendo os prototipos en JavaScript.",
  "workshopper-webgl-workshop": "Aprende os conceptos básicos de WebGL en pequenas e comprensibles partes.",
  "workshopper-esnext-generation": "Introducción a Iteradores ES6, o seu uso, e cómo eles se relacionan cos Xeradores.",
  "workshopper-test-anything": "Aprende a probar o teu código.",
  "workshopper-tower-of-babel": "unha serie de exercicios para presentarte algunhas características de ES6.",
  "workshopper-regex-adventure": "Analiza textos con Expresións Regulares.",
  "workshopper-learnyoumongo": "Comeza con MongoDB e Node.js",
  "workshopper-shader-school": "Aprende os elementos fundamentais de programación gráfica utilizando GLSL shaders.",
  "workshopper-bytewiser": "Aprende cómo manipular data binaria en Node.js e en browsers HTML5.",
  "workshopper-bug-clinic": "Aprende algunhas ferramentas novas e técnicas a medida que melloras as túas habilidades de debugging.",
  "workshopper-browserify-adventure": "Utiliza módulos npm con require() no navegador con browserify.",
  "workshopper-introtowebgl": "Comeza con three.js e WebGL.",
  "workshopper-count-to-6": "Aprende cómo utilizar algunhas características de ES6, a proxima versión de JavaScript.",
  "workshopper-kick-off-koa": "Comeza cos primeiros pasos de Koa, a próxima xeración de frameworks web para Node.js.",
  "workshopper-lololodash": "Aprende Lo-Dash (fork de underscore) para manexar os teus arrays e obxetos de maneira moi simple.",
  "workshopper-learnyoucouchdb": "Aprende acerca de CouchDB - A base de datos que abarca completamente a web.",
  "workshopper-learnuv": "Aprende <i>uv</i> por diversión e ganas, un taller autodirixido para unha librería que alimenta a Node.js.",
  "workshopper-learn-generators": "unha introducción a Xeradores JavaScript ES6.",
  "workshopper-learnyoureact": "Vamos a aprender React.js e Renderización do lado do servidor!.",
  "workshopper-perfschool": "Encontra o camino a través do laberinto de optimizacións de rendemento web!.",
  "workshopper-web-audio-school": "Aprende sobre a API de Audio Web, completando unha serie de leccións interactivas con énfase na música.",
  "workshopper-torrential": "unha serie de leccións que mostran cómo crear unha simple rede bittorrent P2P.",
  "workshopper-thinking-in-react": "Aprende a filosofía de React a través da construcción de UI dende cero.",
  "workshopper-node-debug-school": "Aprende cómo usar <i>post-mortem debugging</i> en SmartOS para facer un debug eficiente en aplicacións Node.js en producción.",
  "workshopper-seneca-in-practice": "Aprende a aproveitar as ferramentas de microservicios de SenecaJS.",
  "workshopper-less-is-more": "Aprende as bases do preprocesador de CSS de LESS.",
  "workshopper-js-best-practices": "Aprende as mellores prácticas para escribir un código limpo en JavaScript.",
  "workshopper-learn-sass": "Aprende os elementos básicos de SASS.",
  "workshopper-pattern-lab-workshop": "Aprende o básico de Pattern Lab.",
  "workshopper-learnyoubash": "Aprende cómo usar unha terminal e a escribir o teu primeiro script en Bash.",
  "workshopper-currying": "Comprende o concepto <i>currying</i> e crea unha <i>función currying </i> en JavaScript",
  "workshopper-bacon-love": "Aprende os conceptos de <i>Funcionalidade</i> e <i>Programación Reactiva</i> usando Bacon.js",
  "workshopper-innersourceadventure": "Aprende sobre o desenvolvemento de software de InnerSource",
  "events-header": "Eventos NodeSchool pasados e próximos",
  "events-past": "Pasados",
  "events-future": "Próximos",
  "events-header2": "Houbo moitos eventos!",
  "events-header3": "Se tí estás organizando un evento NodeSchool, engádeo neste sitio enchendo <a href=\"https://docs.google.com/forms/d/1vYW-Yw82kt_q7WDgBY6gQqFrg3zuD2rDPXEG-cbq7e4/viewform?usp=form_confirm\" target=\"_blank\">este formulario.</a>",
  "events-small": "Se necesitas editar un evento que enviaches, <a href=\"https://github.com/nodeschool/organizers/issues/new\">presentar un issue en nodeschool/organizadores.</a>.",
  "chapters-header": "Cidades arredor do mundo comezaron a organizar eventos NodeSchool regularmente. Aquí atoparás unha lista dos capítulos. Mira o <a href=\"hexdex.html\">hexdex</a> para ver un índice de logos hexagonales dos capítulos.",
  "chapters-europe": "Europa",
  "chapters-us": "US",
  "chapters-latin-america": "América Latina",
  "chapters-australia": "Australia",
  "chapters-asia": "Asia",
  "chapters-other": "Outra rexión?",
  "chapters-start": "Non podes atopar un evento NodeSchool na túa rexión? Tal vez hai xente cerca teu, a que\n lles gustaría comezar un. Abre unha issue no",
  "chapters-start2": "taboleiro de discusións",
  "chapters-start3": "para atopar outras persoas cerca túa. logo podes comezar o teu capítulo seguindo as instruccións en cómo",
  "chapters-start4": "organizar un evento",
  "chapters-start5": ".",
  "about-header": "NodeSchool é un proxecto open source levado a cabo por voluntarios con dous obxetivos: crear plans de estudo de programación de alta calidade e organizar eventos de aprendizaxe comunitario.",
  "about-header-history-title": "Titoriais interactivos",
  "about-history": "O formato \"workshopper\" foi creado por Substack en Internet in Summer 2013 cando escribeu o workshopper stream-adventure.",
  "about-history2": "As características que definen o workshopper so a interactividad e a automatización. Os Talleres son exercicios creados con dificultade crecente. Cada exercicio Comeza explicando un concepto, e logo presenta unha lista de requirimentos para resolver el exercicio. As participantes logo intentan escribir un programa que satisfaga o criterio.",
  "about-history3": "Cuando confían na súa solución, se a indica para su verificación. O workshop corre a súa solución e verifica que todos os requirimentos sean satisfeitos. Se algún criterio non se cumple, o participante obten unha resposta contextual e pode intentar de novo. Se seu código cumple con todos os criterios, entón o exercicio está completo e seguen co seguinte exercicio.",
  "about-history4": "Todo esto sucede de forma automática. Os Talleres poden ser pensados casi como unha bateria de tests unitarios que o participante debe arranxar implementando o código correcto.",
  "about-header-philosophy-title": "Un amplo rango de temas",
  "about-philosophy": "Todos os workshops de NodeSchool estan escritos utilizando Node, pero o tema dun workshop non necesariamente ten que ser acerca de Node. Por exemplo, o workshop shader-school ensina conceptos de computación gráfica e non se require escribir JavaScript en ningún momento.",
  "about-philosophy2": "A comunidade NodeSchool desenvolveu algunhas excelentes ferramentas para crear novos workshops. Se tes unha idea para un workshop nos recomendamos que visites a nosa páxina sobre Construir Workshops.",
  "about-header-info-title": "Eventos arredor do mundo",
  "about-info": "Tivemos comunidades de todos os continentes, excepto na Antártida, que acollen un evento NodeSchool. Calquera persoa pode organizar un evento, e cómo comunidade intentamos recopilar información útil, pasos a seguir e consellos para realizar eventos que sexan divertidos e para todas as persoas. Visita a nosa páxina acerca de cómo organizar un evento para aprender máis.",
  "about-header-touch-title": "Contactanos",
  "about-info2": "Utilizamos GitHub para organizar NodeSchool. O mellor lugar para contactar é o repositorio de organizadores. podes abrir un novo issue nese repositorio, os organizadores serán notificados e podrán responder. Éste método é moito mellor que enviar un correo directamente a algún dos orgnizadores.",
  "about-header-talk-title": "Escucha y mira a las persoas hablar",
  "about-info3": "No episodio 55 do podcast NodeUp Mikeal Rogers, Max Ogden e outros miembros da comunidade conversan sobre NodeSchool. En Cascadia JS 2014 Jason Rhodes, de Baltimore, falar sobre a organización de NodeSchools.",
  "building-workshops-header": "Creando un Workshop NodeSchool",
  "building-workshops-subtitle": "Aquí hai algunhas das ferramentas comúnmente utilizadas para crear workshops NodeSchool.",
  "building-workshops-info": "para obter un framework de workshop con todas as características dunha ferramenta CLI.",
  "building-workshops-info2": null,
  "building-workshops-info3": null,
  "building-workshops-info3A": null,
  "building-workshops-info3B": null,
  "building-workshops-info3C": null,
  "host-header": "Organizando un evento NodeSchool",
  "host-info": "NodeSchool é un esforzo impulsado completamente pola comunidade é 100% open source. Isto significa que calquera pode usar os materiais de NodeSchool e/ou organizar un evento.",
  "host-chapter-header": "Primeiro, crea un capítulo",
  "host-chapter-info": "Primeiro deberías",
  "host-chapter-info2": ". unha vez realizado, busca abaixo recursos acerca de cómo organizar o teu primeiro evento.",
  "host-chapter-info3": "Esta páxina está baseada en",
  "host-chapter-info4": "discusión.",
  "host-chapter-link": "crea un novo capítulo NodeSchool",
  "host-chapter-link2": "Queres realizar un evento?",
  "host-attend-header": "Primeiro, crea un capítulo",
  "host-attend-info": null,
  "host-attend-info2": null,
  "host-attend-link": null
}
